## ===========================================
##          DataFrame 인스턴스 생성 
## -------------------------------------------
## * Pandas에서 여러줄 데이터를 저장하는 데이터 타입
## * 구성 : 행 식별 인덱스 + 열 식별 컬럼명 + 데이터 
## * 함수 : DataFrame(datas) 
## ===========================================
## -------------------------------------------
## [1] 모듈 로딩
## -------------------------------------------
import pandas as pd 

## -------------------------------------------
## [2] DataFrame 인스턴스 생성
## -------------------------------------------
## 데이터 준비
datas = {'A' : [10, 20],
         'B' : [33, 55],
         'C' : [9, 8] }

## DataFrame 인스턴스 생성
df = pd.DataFrame(datas)

## -------------------------------------------
## [3] DataFrame 인스턴스 속성
## -------------------------------------------
print('- DataFrame 기본 속성들 -')
print(f'* index   : {df.index}')
print(f'* columns : {df.columns}')
print(f'* values  : \n{df.values}')
print(f'* shape   : {df.shape}')
print(f'* ndim    : {df.ndim}차원')
print(f'* dtypes  : \n{df.dtypes}')


## -------------------------------------------
## [4] DataFrame 인스턴스 속성 변경
## -------------------------------------------
print("\n --- 변경 전 ---")
print(df)

print("\n --- 변경 후 ---")
df.index   = ["1st", "2nd"]
df.columns = ["A", "B", "C"]

print(df)
 