## =====================================================
## Series 인스턴스 생성
##------------------------------------------------------ 
## * List/ Tuple/ Set 데이터===> Series
## * Dict 데이터 ====> Series
## =====================================================

##------------------------------------------------------
# [1] 모듈 로딩 
##------------------------------------------------------ 
import pandas as pd
import func as fc
##------------------------------------------------------ 
# [2] Series 인스턴스 생성
##------------------------------------------------------
# 
# 데이터 준비 
data1= [11, 33, 55, 77]
data2= 11, 2222, 3333
data3= {11, 33, 55, 77}
data4= {'A': 11, 'B': 44}
data5= "good"

sr1=pd.Series(data1)
sr2=pd.Series(data2)
# sr3=pd.Series(data3) # Unsequence type 불가
sr4=pd.Series(data4) # dict=> Series 시 key는 인덱스로 설정
sr5=pd.Series(data5)


fc.print_info(sr1, 'sr1')
fc.print_info(sr2, 'sr2')
# fc.print_info(sr3, 'sr3')
fc.print_info(sr4, 'sr4')
fc.print_info(sr5, 'sr5')



## =====================================================
## =====================================================