## ========================================================
##      Series 인스턴스 원소/요소 다루기
## --------------------------------------------------------
## * 여러개 원소 읽기 - (1)
##   -> 인스턴스변수명[ [인덱스1, 인덱스2,... n] ]
## ========================================================
## --------------------------------------------------------
## [1] 모듈 로딩
## --------------------------------------------------------
import pandas as pd 

## --------------------------------------------------------
## [2] Seires 인스턴스 생성
## --------------------------------------------------------
## 데이터 준비
data1 = [11,33,55,77]

## Series 인스턴스 생성
sr1 = pd.Series(data1)
sr2 = pd.Series(data1, 
                index=["one","two","three", "four"]) 

## --------------------------------------------------------
## [3] 원소값 여러개 읽기 
## [3-1] 인덱스 리스트 방식  ===> 결과는 Series
##       변수명[ [인덱스1, 인덱스2, ..., 인덱스n ]]
## --------------------------------------------------------
print('\n-----[ 기본 정수 인덱스 ]--------\n')
print("인덱스 속성", sr1.index)
print(f"[1개 요소 읽기] sr1[0]          =>{ type(sr1[0]) }                   \n{ sr1[0] }")

print(f"[여러개 요소 읽기] sr1[[0,2]]   =>{ type(sr1[[0,2]]) }               \n{ sr1[[0,2]] }")
print(f"[여러개 요소 읽기] sr1[[0,1,2]] =>{ type(sr1[[0,1,2]]) }             \n{ sr1[[0,1,2]] }")
print(f"[여러개 요소 읽기] sr1[[0]]     =>{ type(sr1[[0]]) }                 \n{ sr1[[0]] }")


## --------------------------------------------------------
## [3-1] 인덱스 리스트 방식  ===> 결과는 Series
##       변수명[ [인덱스1, 인덱스2, ..., 인덱스n ]]
## --------------------------------------------------------
print('\n-----[ 라벨 인덱스 & 위치 인덱스 ]--------\n')

print("인덱스 속성", sr2.index)
print(f"[1개 요소 읽기] sr2['one']      =>{ type(sr2['one']) }                   \n{ sr2['one'] }")

print(f"[여러개 요소 읽기] sr2[[0,2]]   =>{ type(sr2[['one','three']]) }         \n{ sr2[['one','three']] }")
print(f"[여러개 요소 읽기] sr2[[0,1,2]] =>{ type(sr2[['one','two','three']]) }   \n{ sr2[['one','two','three']] }")
print(f"[여러개 요소 읽기] sr2[[0]]     =>{ type(sr2[['one']])}                  \n{ sr2[['one']] }")
