## ===============================================
##              통계 관련 메서드들
## ===============================================
## [1] 모듈 로딩
## ----------------------------------
import sys
sys.path.append(r'D:\KDT\VS_KDT_14\[2]_PANDAS\comm')
import utils
import pandas as pd 

## ----------------------------------
## [2] 데이터 준비
## ----------------------------------
DATA_FILE = '../DATA/iris.csv'

## ----------------------------------
## [3] CSV >>> DataFrame 변환 저장
## ----------------------------------
irisDF = pd.read_csv(DATA_FILE)

## ----------------------------------
## [4] DataFrame 기본 정보 확인
## ----------------------------------
#utils.data_info(irisDF)

## ------------------------------------------------
## [5] 통계 관련 메서드들
## ------------------------------------------------
## => 상관계수 계산 후 DataFrame 반환 : corr()
## => 수치 데이터 기반 계산
## => 컬럼들의 관계성을 -1 ~ 1 범위로 반환
## => 목적
##    * 주제와 관련된 변수/속성/컬럼 여부 검사용
##    * 선택된 변수/속성/컬럼 중 비슷한 속성들 필터링용
## ------------------------------------------------
corrDF = irisDF.corr(numeric_only=True)
print(f'[상관계수] corrDF =>\n{corrDF}')

## 타겟/주제에 해당하는 컬럼만 추출
print( corrDF['petal.length'].abs().sort_values(ascending=False) )