## ====================================
## 컨테이너 자료형- [4] Dict 타입
##
##
## -형식: {키1: 값, 키2: 값, ..., 키n:값}
##         dick({키1: 값, 키2: 값, ..., 키n:값})
## 특징: 키는 unique 해야하는데 만약 중복된다면 마지막 값이 저장됨
##          + 순서 없음==> 키로 데이터/ 값을 읽기/ 추출/ 선택 가능하기 때문
## ====================================

## dick 데이터 생성
## -------------------------
## [예시] 6개 과목별 점수 저장
#   국어 99, 미술 80, 음악 100, 물리 90, 수학 81, 영어 72
jumsuDict1={'국어': 99, '미술': 80, '음악': 100, '물리': 90, '수학':81, '영어': 72 }
jumsuDict2={'국어': 99, '체육': 80, '경제': 100}

print(f"jumsuDict1=> 타입:{type(jumsuDict1)}, 원수 개수:{len(jumsuDict1)}, 데이터: {jumsuDict1} ")
print(f"jumsuDict=> 타입:{type(jumsuDict2)}, 원수 개수:{len(jumsuDict2)}, 데이터: {jumsuDict2} ")




## =================================================================
## 연산자: (1) 덧셈: dict+ dict: 미지원 기능
## =================================================================

# new_dict= jumsuDict1 + jumsuDict2 ##===> error 발생



## =================================================================
## 연산자: (2) 곱셈: dict* 정수: 미지원 기능
## =================================================================

# new_dict= jumsuDict1 * 2 ##===> error 발생


## =================================================================
## 연산자: (3) 멤버 연산자: in/ not in 
##          ★ 단 key 만 가능
## =================================================================

# 키 존재 여부

print(f" '경제' in jumsuDict1: {'경제' in jumsuDict1}")
print(f" '경제' in jumsuDict2: {'경제' in jumsuDict2}")

# 값 존재 여부==> 에러
print(f" 99 in jumsuDict1: {99 in jumsuDict1}")
print(f" 99 in jumsuDict2: {99 in jumsuDict2}")



## =================================================================
## Dict 자료형의 원소 다루기=> (2) 데이터 변경: 변수명[키] = 값
## =================================================================

## 미술 점수 80==> 92점 변