## ====================================
## 컨테이너 자료형- [4] Dict 타입
##
##
## -dict와 내장함수: len(), max(), min(), 
## ====================================

## dick 데이터 생성
## -------------------------
## [예시] 6개 과목별 점수 저장
#   국어 99, 미술 80, 음악 100, 물리 90, 수학 81, 영어 72
jumsuDict1={'국어': 99, '미술': 80, '음악': 100, '물리': 90, '수학':81, '영어': 72 }
jumsuDict2={'국어': 99, '체육': 80, '경제': 100}

print(f"jumsuDict1=> 타입:{type(jumsuDict1)}, 원수 개수:{len(jumsuDict1)}, 데이터: {jumsuDict1} ")
print(f"jumsuDict=> 타입:{type(jumsuDict2)}, 원수 개수:{len(jumsuDict2)}, 데이터: {jumsuDict2} ")




## =================================================================
## 내장함수 max(), min() : 키만 비교 @@@   값은 비교 안 함
## =================================================================

mx, mn=max(jumsuDict1), min(jumsuDict1)


## =================================================================
## 내장함수 sorted() : 키만 정렬   @@@   값은 고려대상 아님
## =================================================================


## ============================================================
## dict 메서드 : 값만 보는 메서드 values() -> dict_values 타입 반환
## ============================================================
values = jumsuDict1.values()
print(f"jumsuDict1 값 : {values}  {type(values)}")


## ============================================================
## dict 메서드 : (키,값) 묶음으로 보는 메서드 items() -> dict_items 타입 반환
## ============================================================
items = jumsuDict1.items()
print(f"jumsuDict1 값 : {items}  {type(items)}")

## --------------------------------------------------------------
## 특징 : 인덱싱 방식으로 변수명[인덱스] 읽기 불가 ===> list/tuple로 형변환 후 가능
##       for ~ in 반복문으로 접근은 가능  
## --------------------------------------------------------------
for v in values: print( v )

for k in keys:   print( k )

for i in items:  print( i )

for k, v in items:  print( f"{k} - {v:>3}점" )   


## ============================================================
## dict 메서드 : 값을 읽어오는 메서드 get(키, 기본값)
##              -> 기본값 : 키가 존재하지 않을 시 반환할 값  
## ============================================================
value = jumsuDict1.get('경제', "존재하지 않는 키입니다.")
print(f"jumsuDict1.get('경제') : {value}")

value = jumsuDict1.get('경제', 0)
print(f"jumsuDict1.get('경제') : {value}")