##====================================================
##  컨테이너 자료형 - [4] Dict 타입
##
##  -dict 전용 함수 즉 메서드 살펴보기
##==========================================================
## dict 데이터 생성
##--------------------------------------------
## [예시] 6개 과목별 점수를 저장
##          국어 99, 미술 80, 음악 100. 물리 90, 영어 72, 수학 81
jumsuDict1 = {'국어': 99, '미술':80, '음악':100, '물리':90, '영어':72, '수학':81}


print(f"jumsuDict1=> 타입 : {type(jumsuDict1)}, 원소 개수 : {len(jumsuDict1)}, 데이터 : {jumsuDict1}")


##==================================================================
##  dict 메서드 : 키만 읽는 메서드 keys() -> dict_keys 타입 반환
##==================================================================
keys = jumsuDict1.keys()
print(f"jumsuDict1 키 : {keys} {type(keys)}")

##==================================================================
##  dict 메서드 : 값만 읽는 메서드 values() -> dict_values 타입 반환
##==================================================================
values = jumsuDict1.values()
print(f"jumsuDict1 키 : {values} {type(values)}")


##==================================================================
##  dict 메서드 :  (키, 값) 묶음으로 보는 메서드 items() -> dict_items 타입 반환
##==================================================================
items = jumsuDict1.items()
print(f"jumsuDict1 키 : {items} {type(items)}")

## 특징 : 인덱싱 방식으로 읽기 불가 ===> list/tuple로 형변환 후 가능
##       for ~ in 반복문으로 접근은 가능


for v in values: print(v)

for k in keys: print(k)

for i in items: print(i)

for k, v in items: print( f"{k}- {v:>3} 점")






##==================================================================
##  dict 메서드 : 값을 읽어오는 메서드 get(키, 기본값) 
#               -> 기본값: 키가 존재하지 않을 시 반환할 값 
##==================================================================

value= jumsuDict1.get('경제')
print(f"jumsuDict1.get('경제') : {value}") #===========> none 반환


value= jumsuDict1.get('경제', 0) # ======> 0 반환
print(f"jumsuDict1.get('경제') : {value}") #===========> none 반환