## ====================================================================
## 람수 표현식 / 람다 함수 / 익명 함수
## ====================================================================
## -> 재사용될 가능성은 낮지만, 문법상 함수가 필요한 경우 
## -> 이름이 없는 1줄 함수  
## -> 형식 : lambda 매개변수1,.., 매개변수 : 코드           
## ====================================================================
## --------------------------------------------------------------------
## [예시] 사용법 이해
## --------------------------------------------------------------------
print("[매개변수 없는 람다] (lambda : 100)()                =>  " , (lambda : 100)() )
print("[매개변수 1개 람다] (lambda a: 100*a)(3)             =>  " , (lambda a: 100*a)(3) )
print("[매개변수 3개 람다] (lambda a, b, c: a*b*c)(1,2,3)   =>  " , (lambda a,b, c: a*b*c)(1,2,3) )
print("[매개변수 3개 람다] (lambda a, b, c:None)(1,2,3)     =>  " , (lambda a, b, c: None)(1,2,3) )


print("[매개변수 3개 람다] (lambda a, b, c:None)(1,2,3)     =>  " , (lambda a, b, c: None)(1,2,3) )

