## ============================================================
## 컨테이너 자료형 - [4] Dict 타입
##
## - dict와 연산자 
## ============================================================
## dict 데이터 생성
## ----------------------------------
## [예시] 6개 과목별 점수를 저장
##       국어 99, 미술 80, 음악 100, 물리 90, 영어 72, 수학 81
jumsuDict1 = {'국어':99,  '미술':80, '음악':100, '물리':90, '영어':72, '수학': 81} 
jumsuDict2 = {'국어':100, '체육':70, '경제': 100} 

print(f"jumsuDict1=> 타입 :{type(jumsuDict1)},  원소 개수 : {len(jumsuDict1)},  데이터 : {jumsuDict1}")
print(f"jumsuDict=>  타입 :{type(jumsuDict2)},  원소 개수 : {len(jumsuDict2)},  데이터 : {jumsuDict2}")

## ============================================================
## 연산자  : (1) 덧셈 : dict + dict   : 미지원 기능
## ============================================================
#new_dict = jumsuDict1 + jumsuDict2 ## ==> ERROR 발생

## ============================================================
## 연산자  : (2) 곱셈 : dict *int  : 미지원 기능
## ============================================================
#new_dict = jumsuDict1 * 2 ## ==> ERROR 발생

## ============================================================
## 연산자  : (3) 멤버 연산자 : in / not in 
##          ★ 단!!! key만 가능 
## ============================================================
## 키 존재 여부 체크 
print(f" '경제' in jumsuDict2  : { '경제' in jumsuDict2 }")
print(f" '경제' in jumsuDict1  : { '경제' in jumsuDict1 }")

## 값 존재 여부 체크  ==> ★ 키만 존재 여부 체크함!!!
print(f" 99 in jumsuDict2  : { 99 in jumsuDict2 }")
print(f" 99 in jumsuDict1  : { 99 in jumsuDict1 }")