## ============================================================
## 컨테이너 자료형 - [4] Dict 타입
##
## - dict와 내장함수 : len(), max(), min(), sum(), sorted()
## ============================================================
## dict 데이터 생성
## ----------------------------------
## [예시] 6개 과목별 점수를 저장
##       국어 99, 미술 80, 음악 100, 물리 90, 영어 72, 수학 81
jumsuDict1 = {'국어':99,  '미술':80, '음악':100, '물리':90, '영어':72, '수학': 81} 

print(f"jumsuDict1=> 타입 :{type(jumsuDict1)},  원소 개수 : {len(jumsuDict1)},  데이터 : {jumsuDict1}")

## ============================================================
## 내장함수 max() / min() : ★ 키만 비교함!! 값은 고려대상 아님!
## ============================================================
mx, mn = max(jumsuDict1), min(jumsuDict1) 

print(f'최대값: {mx}, 최소값 : {mn}')


## ============================================================
## 내장함수 sorted()      : ★ 키만 정렬함!! 값은 고려대상 아님!
##                         결과는 항상 list 반환
## ============================================================
ret = sorted(jumsuDict1)
print(f"정렬 결과 : {ret},  {type(ret)}") 
