## =============================================================
## 컨테이너 자료형 - [3] str타입
##
## - str 전용 함수 즉, 메서드 이해
## =============================================================
## -------------------------------------------------------------
## [7] 문자열의 앞부분과 끝부분의 공백 제거하는 메서드 : strip()
##     ★ 문자열 사이의 공백은 제거하지 않음!!!
## -------------------------------------------------------------
msg= "   Good Luck~!!!  "             # 앞에 3개, 끝에 2개 공백

##-> 원본 str 데이터 
print(f"msg 원소 개수 : {len(msg)}개,  {msg}")

##-> 앞부분, 끝부분 공백 모두 제거 
msgall = msg.strip()
print(f"msgall 원소 개수 : {len(msgall)}개,  {msgall}")

##-> 앞부분 공백만 모두 제거 
msgleft = msg.lstrip()
print(f"msgleft 원소 개수 : {len(msgleft)}개,  {msgleft}")

##-> 끝부분 공백만 모두 제거 
msgright = msg.rstrip()
print(f"msgright 원소 개수 : {len(msgright)}개,  {msgright}")

## -------------------------------------------------------------
## [8] 문자열의 앞부분과 끝부분의 특정 문자/문자열 제거하는 메서드 : strip()
##     ★ 문자열 사이의 공백은 제거하지 않음!!!
## -------------------------------------------------------------
data="flower.jpg"
name_data = data.rstrip(".jpg")
print(data, name_data, sep=' ===> ')

data="exflower.jpg"
name_data = data.rstrip(".jpg")
name_data = name_data.lstrip("ex")
print(data, name_data, sep=' ===> ')


## -------------------------------------------------------------
## [9] str의 끝부분 즉, 오른쪽에서 왼쪽으로 이동하며 인덱스 찾기 메서드
##     rindex() : 끝 -->앞으로 이동하면서 찾기, 없으면 Error 발생
##     rfind()  : 끝 -->앞으로 이동하면서 찾기, 없으면  -1   반환
## -------------------------------------------------------------
datas  =  [3, 1, -2, 8, 3, 1, 1, 3] 
datas  =  "3 1 -2 8 3 1 1 3"
# index() ==> 
# find() 
#                               <== rindex(), rfind()

# => 데이터 '3'의 인덱스 찾기. 단, 마지막 '3'의 인덱스 찾기
idx = datas.index('3')           # 첫번째 데이터 3의 인덱스   
print(f"첫번째 3의 인덱스 : {idx}")  

idx = datas.index('3', idx+1)    # 첫번째 데이터 3의 인덱스 그 다음부터 찾기
print(f"두번째 3의 인덱스 : {idx}")  

idx = datas.index('3', idx+1)    # 두번째 데이터 3의 인덱스 그 다음부터 찾기 => 마지막 3
print(f"세번째 3의 인덱스 : {idx}") 

## => 바로 끝부분에서 인덱스 찾기 ---------------
idx = datas.rindex('3')
print(f"세번째 3의 인덱스 : {idx}") 

idx = datas.rindex('1')
print(f"마지막 1의 인덱스 : {idx}") 

idx = datas.rfind('1')
print(f"마지막 1의 인덱스 : {idx}") 