## ==================================================
##          DataFrame/ Series 행/열/원소 추가/ 수정
## ==================================================

import pandas as pd

## [2] 인스턴스 할당

dataDF = pd.DataFrame(
    [[10, 20, 30, 40.],
     [11, 22, 33, 44.]],
    columns=['영', '일', '이', '삼'],
    index=['row0', 'row1']
)


# [3] Series 원소 추가/ 수정 -------------------
# 추가: 변수명[인덱스]= 원소값
#       변수명.loc[인덱스] = 원소값
#       변수명.iloc[인덱스] = 원소값 <== 불가능
# 
# ---------------------------------------------

dataSR= dataDF.loc['row0'] 
print("DataSR 원본\n", dataSR, sep='\n')

## [3-1] 원소 추가 --------------------------
dataSR['사']= 100
dataSR.loc[5]= 55
print("DataSR 추가 후\n", dataSR, sep='\n')

# dataSR.iloc[6]=9 # iloc[] 원소에 위치를 부여하는 방식
#                    원소 추가에 사용 불가능

## [3-2] 원소 수정/ 변경 --------------------------
dataSR['사']= 7
dataSR.loc[5]= '오'
dataSR.iloc[5]= 999

print("DataSR 수정 후\n", dataSR, sep='\n')


# ---------------------------------------------
# [4] DataFrame 행/열 추가, 행/열/원소 수정 -------------------
# 추가: 변수명[인덱스]= 원소값
#       변수명.loc[인덱스] = 원소값
#       변수명.iloc[인덱스] = 원소값 <== 불가능
# ---------------------------------------------

