## ======================================================================
##     DataFrame 원소 다루기 
## ----------------------------------------------------------------------
## * 특정 위치 원소/요소 선택 
##    -> df변수명.iloc[ 행 정수 위치 인덱스, 열 정수 위치 인덱스]
##    -> df변수명.loc[  행 라벨 인덱스,  열 라벨 인덱스 ]
## 
## * 행 선택 후 선택된 행 중에서 열 선택
##    -> df변수명.loc[ 행 선택 ][ 컬럼 선택 ]  
##    -> df변수명.iloc[ 행 선택 ][ 컬럼 선택 ]  
## ======================================================================
## ----------------------------------------------------------------------
## [1] 모듈 로딩
## ----------------------------------------------------------------------
import pandas as pd 

## ----------------------------------------------------------------------
## [2] DataFrame 인스턴스 생성
## ----------------------------------------------------------------------
## 데이터 준비
datas = [ [11,33,55,77], 
          [ 2,22, 4,44] , 
          ['A',10,'B',0] ]

## DataFrame 인스턴스 생성
df = pd.DataFrame(datas, 
                  index  =["1st","2nd", "3th"],
                  columns=['A','B','C','D'])
print(df)

## ----------------------------------------------------------------------
## [3] DataFrame 인스턴스 속성 읽기
## ----------------------------------------------------------------------
print('- DataFrame 기본 속성들 -')
print(f'* index   : {df.index}')        ## 표/데이터프레임 행 식별 인덱스
print(f'* columns : {df.columns}')      ## 표/데이터프레임 컬럼 식별


## ----------------------------------------------------------------------
## [4] 특정 원소 선택
## ----------------------------------------------------------------------
print("\n ---원소값 22 선택 ---")
print("[ df.iloc[1, 1] ] ",      type(df.iloc[1, 1]),      df.iloc[1,1])
print("[ df.loc['2nd', 'B'] ] ", type(df.loc['2nd', 'B']), df.loc['2nd', 'B'])

print("\n ---원소값 A 선택 ---")
print("[ df.iloc[2, 0] ] ",      type(df.iloc[2, 0]),      df.iloc[2, 0])
print("[ df.loc['3th', 'A'] ] ", type(df.loc['3th', 'A']), df.loc['3th', 'A'])
print("\n -------------")

## ----------------------------------------------------------------------
## [5] 여러개 열/컬럼 선택 
##    -> df변수명.loc[ 행 선택,   시작 컬럼 이름 : 끝 컬럼 이름 : 간격  ]  
##    -> df변수명.iloc[ 행 선택,  시작 컬럼 위치 인덱스 : 끝 컬럼 위치 인덱스 : 간격 ]  
## ----------------------------------------------------------------------
print("\n ---원소값 22 선택 ---")
print("[ df.iloc[1, 1] ] ",     type(df.iloc[1][1]),      df.iloc[1][1])
print("[ df.iloc[1]['B'] ]",    type(df.iloc[1]['B']),    df.iloc[1]['B'])
print("[ df.loc['2nd']['B'] ]", type(df.loc['2nd']['B']), df.loc['2nd']['B'])
print("[ df.loc['2nd']['B'] ]", type(df.loc['2nd'][1]), df.loc['2nd'][1])
print("\n -------------")