## ======================================================================
##     Series 원소 변경 / 삭제 / 추가
## ----------------------------------------------------------------------
## ======================================================================
## ----------------------------------------------------------------------
## [1] 모듈 로딩
## ----------------------------------------------------------------------
import pandas as pd 

## ----------------------------------------------------------------------
## [2] Series 인스턴스 생성
## ----------------------------------------------------------------------
## 데이터 준비
datas = ['A',10,'B',0]

## Series 인스턴스 생성
sr = pd.Series(datas, index=["가", "나", "다", "라"])
print("\n===> Series\n", sr, sep='')

## ----------------------------------------------------------------------
## [3] Series 원소 변경 
## => Series변수명[인덱스] = 새로운 값
## => Series변수명.iloc[인덱스] = 새로운 값
## => Series변수명.loc[인덱스] = 새로운 값
## ----------------------------------------------------------------------
sr.iloc[0]   = 200        ## sr[0] = 200
sr.iloc[2]   = 77         ## sr[2] = 77
sr.loc["나"] = 20         ## sr["나"] = 20
sr["라"]     = 99         ## sr["라"] = 99

print("\n===> 변경 후\n", sr, sep='')

## ----------------------------------------------------------------------
## [4] Series 원소 추가 
## => Series변수명[인덱스]     = 새로운 값
## => Series변수명.loc[인덱스] = 새로운 값
##
## => ★ Error 
## => Series변수명.iloc[인덱스] = 새로운 값  X
## ----------------------------------------------------------------------
sr["하"] = "ABC"
sr.loc[10] = "백"
print("\n===> 변경 후\n", sr, sep='')

sr[100] = 9
#sr.iloc[87] = "백"
print("\n===> 변경 후\n", sr, sep='')


## ----------------------------------------------------------------------
## [5] Series 원소 삭제
## => del  Series변수명[라벨인덱스] 
## => Series변수명.drop(index, inplace=False)
##    * inplace = False  : 원본 유지, 복사본 반환
##    * inplace = True   : 원본 변경, None 반환
## ----------------------------------------------------------------------
print(f'sr.index => {sr.index}')

#del sr[0]           ## KeyError : 0   라벨인덱스 0 없음
del sr['가']
print("\n===> del sr['가'] 삭제 후 \n", sr, sep='')

print(f'\nsr.index => {sr.index}')
new_sr = sr.drop(index='나')

print("\n===> sr.drop(index='나') 삭제 후\n", sr, sep='', end='\n\n')
print(new_sr)