## ==================================================
## 컨테이너 자료형 - [1] List
##
## * List와 연산자 
## ==================================================
## ----------------
## List 생성
## ----------------
## 1~30 범위에서 7의 배수로만 구성된 데이터 
## 7, 14, 21, 28, 32,.....
##datas = [7,14,21,32,....]
datas = range(7, 31, 7)     ## 타입이 range 즉, 범위 객체 
datas = list(datas)         ## range => list 형변환
print(datas, len(datas))

## -------------------------------------------
## 연산자 : list + list  => 새로운 list 반환
## -------------------------------------------
new_datas = datas + datas 

print("datas:",     datas,     len(datas))
print("new_datas:", new_datas, len(new_datas))

## -------------------------------------------
## 연산자 : list - list  => 불가! 지원하지 않음!!
## -------------------------------------------
#new_datas = datas - datas 


## -------------------------------------------
## 연산자 : list * int  => 정수 숫자 만큼 원소 반복
##                        list 원소가 많아짐 : 확장
##                        새로운 리스트 반환!!
## -------------------------------------------
new_datas = datas * 3

print("datas:",     datas,     len(datas))
print("new_datas:", new_datas, len(new_datas))


## -------------------------------------------
## 연산자 : 데이터 in list  => 데이터가 list에 존재 여부
##                           멤버 연산자
##                           True/False 결과값
## -------------------------------------------
print(f"8 in datas => {8 in datas}")
print(f"7 in datas => {7 in datas}")


## -------------------------------------------
## 연산자 : 데이터 not in list  => 데이터가 list에 존재 여부
##                               멤버 연산자
##                               True/False 결과값
## -------------------------------------------
print(f"8 not in datas => {8 not in datas}")
print(f"7 not in datas => {7 not in datas}")
