## ========================================================
## 기본+컨테이너자료형 - [3] str 타입
##
## * 산술 연산자
##   + : str + str만 가능 ==> str 연결
##   * : str * int만 가능 ==> str을 정수만큼 반복 연결
## ========================================================
## --------------------------
## str 생성
## --------------------------
msg  = "Good Luck"
year = str('2026!!')

## --------------------------
## str과 산술 연산자 : 덧셈 => 연결
## --------------------------
new_msg = msg + " " + year

print(f"msg  : {msg}")
print(f"year : {year}")
print(f"new_msg : {new_msg}")

## --------------------------
## str과 산술 연산자 : 곱셈 => str 반복 연결
## --------------------------
new_msg = (msg +" ") * 5
print(f"msg  : {msg}")
print(f"year : {year}")
print(f"new_msg : {new_msg}")


## ========================================================
## * 멤버 연산자
##   데이터 in str      : 존재하면 True
##   데이터 not in str  : 존재하지 않으면 True
## ========================================================
msg="Happy Day!"

print(f"'h' in msg  : {'h' in msg}") 
print(f"'H' in msg  : {'H' in msg}") 
print(f"'HA' in msg : {'HA' in msg}") 
print(f"'Ha' in msg : {'Ha' in msg}") 