## =================================================================
## 컴프리헨션(Comprehension)
## -> 반복문+ 조건문=> 컨테이너 자료형 생성
## =================================================================
## -----------------------------------------------------------------
## [형식 1] 반복문으로 컨테이너 자료형 생성
##         [원소 for 원소 in 반복 가능한 자료형]
## -----------------------------------------------------------------

# orgList의 원소에 3을 곱한 값으로 새로운 newList 생성하기

orgList= [1, 2, 3]
print(f"orgList=> {orgList}")
# 기본 방식
newList=[]

for num in orgList:
    newList.append(num* 3)
print(f"기본 newList=> {newList}")

## -> 간결하게 (Comprehension)
newList=[num*3 for num in orgList]
print(f"orgList=> {newList}")

