## ===============================================
## 기본 자료형 - bool 타입
## ===============================================
## ->  맞다/참이다/Yes 의미 ---> 기계어 1
## ->틀리다/거짓이다/No 의미 ---> 기계어 0
## *** 정수 1과 논리 1,  정수 0과 논리 0  식별 모호
## *** 모호성을 해결하기 위한 자료형
## 
## -> 저장가능한 데이터 : True, False 2개만 존재
## ===============================================
## -----------------------------------------------
## bool 데이터 생성
## -----------------------------------------------
data1 = False 
data2 = True
data3 = bool(False)

print(data1, type(data1))
print(data2, type(data2))
print(data3, type(data3))

## -----------------------------------------------
## bool자료형과 다른 자료형 사이의 변환 
## -> 형식 : bool( 데이터 ) : 해당 데이터를 bool 타입으로 변환
## -----------------------------------------------
## [1] int/float< - > bool 형변환 : 0만 False, 나머지는 True
## -----------------------------------------------
data1, data2 = -9 , 0

print(f'{data1} >>> bool({data1}) : {bool(data1)}', end=",  ") 
print(f'{data2} >>> bool({data2}) : {bool(data2)}') 

print(f'True  >>> int(True)  : {int(True)}', end=",  ") 
print(f'False >>> int(False) : {int(False)}') 


## -----------------------------------------------
## [2] str< - > bool 형변환 : 원소 개수가 0개 False, 1개이상이면 True
## -----------------------------------------------
data1, data2 = ' ', ''

print(f'" " >>> bool(" ") : {bool(data1)}', end=",  ") 
print(f'""  >>> bool("")  : {bool(data2)}') 

print(f'True  >>> str(True)  : {str(True)}', end=",  ") 
print(f'False >>> str(False) : {str(False)}') 