## =======================================================================
## 사용자 정의 함수 실습
## =======================================================================
## [1] 사용자가 지정한 범위의 숫자들 중에서 짝수인 숫자만 합계를 해서 반환해주는 함수
## 예시: 5, 100===> 범위에서 2의 배수만 합계 계산
## =======================================================================

def even_sum(start, end):
    total = 0
    
    for num in range(start, end + 1):
        if num % 2 == 0:
            total += num
            
    return total

result = even_sum(5, 100)
print(f"5~100 사이 짝수 합계: {result}")

## =======================================================================
## [2] 전달받은 단어에 대한 기계코드값 출력해주는 함수
## 예시: 'Hello' => 모니터에 'Hello' 기계코드: 11----- 00010
## =======================================================================

def machine_code(word):
    for qlrch in word:
        print(f"{ch} : {format(ord(ch), '08b')}")
