## =======================================================================
## 함수의형태: 4개
## -> 매개변수/ 파라미터 O, 반환값/ 리턴값 O
## -> 매개변수/ 파라미터 O, 반환값/ 리턴값 X
## -> 매개변수/ 파라미터 X, 반환값/ 리턴값 O
## -> 매개변수/ 파라미터 X, 반환값/ 리턴값 X

## => 함수를 정의하는 개발자가 형태 정함!
##    함수 기능을 구현하는 사람 마음대로!
## ========================================================================
## 함수기능: 2개의 정수를 덧셈
## 함수이름: addTwo
## ========================================================================
## [형태1] 매개변수/ 파라미터: 2개 변수 num1, num2
##         반환값/ 리턴값: 덧셈결과
## ========================================================================


def addTwo(num1, num2):
    ret= num1+ num2