## =================================================
## 함수의 형태 : 4개
## -> 매개변수/파라미터 O,  반환값/리턴값 O
## -> 매개변수/파라미터 O,  반환값/리턴값 X
## -> 매개변수/파라미터 X,  반환값/리턴값 O
## -> 매개변수/파라미터 X,  반환값/리턴값 X
##
## => 함수를 정의하는 개발자가 형태 정함!!
##    함수 기능을 구현하는 사람 마음대로!!
## =================================================
## 함수기능 : 2개의 정수를 덧셈
## 함수이름 : addTwo
## =================================================
## -------------------------------------------------
## [형태1] 매개변수/파라미터 : 2개 변수 num1, num2
##        반환값/리턴값     : 덧셈결과
## -------------------------------------------------
def addTwo1(num1, num2):
    total = num1 + num2
    return total

## -------------------------------------------------
## [형태2] 매개변수/파라미터 : 2개 변수 num1, num2
##        반환값/리턴값     : 없음
## -------------------------------------------------
def addTwo2(num1, num2):
    total = num1 + num2
    print(f"{num1} + {num2} = {total}") 


## -------------------------------------------------
## [형태3] 매개변수/파라미터 : 없음
##        반환값/리턴값     : 덧셈 
## -------------------------------------------------
def addTwo3():
    total = 3 + 9
    return total

## -------------------------------------------------
## [형태4] 매개변수/파라미터 : 없음
##        반환값/리턴값     : 없음 
## -------------------------------------------------
def addTwo4():
    total = 3 + 9
    print(f"{3} + {9} = {total}") 

## -------------------------------------------------
## [권장]  매개변수/파라미터 : 없음 /있음
##        반환값/리턴값     : 사용
##        ==> 함수 코드의 정상 동작 여부 체크를 위해서
##            반환값/리턴값 주기를 권장!!
## -------------------------------------------------

## =================================================
## 함수 사용하기 => 함수호출 : 함수이름( )
##                함수호출하지 않으면 절대 실행 X
##
## -> 매개변수 O, 반환값 O 호출 경우 :  변수명=함수이름(데이터, 데이터..)
## -> 매개변수 O, 반환값 X 호출 경우 :  함수이름(데이터, 데이터..)
## -> 매개변수 X, 반환값 O 호출 경우 :  변수명=함수이름( )
## -> 매개변수 X, 반환값 X 호출 경우 :  함수이름( )
## =================================================
## -------------------------------------------------
## [호출1] 매개변수 O, 반환값 O 호출 경우 
## -------------------------------------------------
result = addTwo1(6, 8)
print(f'result : {result}')


## -------------------------------------------------
## [호출2] 매개변수 O, 반환값 X 호출 경우 
## -------------------------------------------------
result = addTwo2(6, 8)
print(f'result : {result}')   ## 반환되는 것이 없어서 None. ERROR 발생 X

## 기본사용법
addTwo2(6, 8)


## -------------------------------------------------
## [호출3] 매개변수 X, 반환값 O 호출 경우 
## -------------------------------------------------
result = addTwo3()
print(f'result : {result}')   

addTwo3()         ## 반환값 저장하지 않아서 ERROR 발생 X
addTwo3(1,2,3)    ## ★ 매개변수 없는 함수에 제공 시 ERROR 발생


## -------------------------------------------------
## [호출4] 매개변수 X, 반환값 x 호출 경우 
## -------------------------------------------------
result = addTwo4()           ## 반환값 없어서 None 저장. ERROR 발생 X
print(f'result : {result}')   

addTwo4()         ## 반환값 경우
addTwo4(1,2,3)    ## ★ 매개변수 없는 함수에 제공 시 ERROR 발생