## =================================================
##          키워드 파라미터 가변인자 매개변수 함수
## -------------------------------------------------
## =================================================
## 함수기능 : 학생의 학점을 출력해주는 기능
##           학생마다 과목 개수와 과목이 다름!! 
## 함수이름 : getGarde
## 매개변수 : **jumsu
## 함수결과 : grade
## =================================================
def getGarde(**jumsu):
    #print("키워드파라미터 : " , type(jumsu))
    grade = 0
    for jum in jumsu.values():
        grade = grade + jum 

    # 과목수로 나누기
    avg = grade/len(jumsu) if len(jumsu) else 0 

    return avg

## =================================================
## 함수기능 : 0개 ~ n개의 정수를 전달받고 덧셈 후 결과 반환
## 함수이름 : addInt
## 매개변수 : 고정 X,  *nums
## 함수결과 : total
## =================================================
def addInt(*nums):
    #print("가변인자 매개변수 타입 : ", type(nums))
    return sum(nums)

## ---------------------------------------------------
## 함수 사용 즉, 호출
## => 함수 호출 시 전달되는 아규먼트/인수 :  *변수명 => 언팩킹해서 전달
## ---------------------------------------------------
data =[11,22,33,44,55]
print(f" addInt(11,22,33,44,55)  :  {addInt(11,22,33,44,55) }")
## 함수 호출
print(f" addInt(*data)           :  {addInt(*data) }")

jum= {'sci':100, 'art':99, 'com':89}

print(f" getGarde(sci=100, art=99, com=89) : {getGarde(sci=100, art=99, com=89) }")
print(f" getGarde(**jum)                   : {getGarde(**jum) }")