## =================================================
##                  가변인자 매개변수 함수
## ------------------------------------------------
## -> 매개변수 이름 : *변수명
## -> 매개변수 개수 : 0개 ~ N개
## =================================================
## 함수기능 : 2개의 정수를 전달받고 덧셈 후 결과 반환
## 함수이름 : addTwo
## 매개변수 : num1, num2
## 함수결과 : total
## =================================================
def addTwo(num1, num2):
    total = num1 + num2
    return total

## =================================================
## 함수기능 : 5개의 정수를 전달받고 덧셈 후 결과 반환
## 함수이름 : addFive
## 매개변수 : num1, num2, num3, num4, num5
## 함수결과 : total
## =================================================
def addFive(num1, num2, num3, num4, num5):
    total = num1 + num2 + num3 + num4 + num5
    return total

## =================================================
## 함수기능 : 3개의 정수를 전달받고 덧셈 후 결과 반환
## 함수이름 : addThree
## 매개변수 : num1, num2, num3
## 함수결과 : total
## =================================================
def addThree(num1, num2, num3):
    total = num1 + num2 + num3
    return total

## =================================================
## 함수기능 : 4개의 정수를 전달받고 덧셈 후 결과 반환
## 함수이름 : addFour
## 매개변수 : num1, num2, num3, num4
## 함수결과 : total
## =================================================
def addFour(num1, num2, num3, num4):
    total = num1 + num2 + num3 + num4 
    return total

## =================================================
## 함수기능 : 0개 ~ n개의 정수를 전달받고 덧셈 후 결과 반환
## 함수이름 : addInt
## 매개변수 : 고정 X,  *nums
## 함수결과 : total
## =================================================
def addInt(*nums):
    #print("가변인자 매개변수 타입 : ", type(nums))
    return sum(nums)

## ---------------------------------------------------
## 함수 사용 즉, 호출
## ---------------------------------------------------
print(f" addInt()                    :  {addInt() }")
print(f" addInt(3,8,1,9,12,3,4,6,10) :  {addInt(3,8,1,9,12,3,4,6,10) }")
print(f" addInt(2.,5)                :  {addInt(2,5) }")
