## =================================================
## 함수의 매개변수/파라미터 
##
## -> 함수 코드 실행 시에 필요판 데이터를 전달 받는 변수
## -> 함수마다 개수가 다름 또는 없는 경우도 있음
#
## =================================================
## 함수기능 : 2개의 정수를 전달받고 덧셈 후 결과 반환
## 함수이름 : addTwo
## 매개변수 : num1, num2
## 함수결과 : total
## =================================================
def addTwo(num1, num2):
    total = num1 + num2
    return total


## =================================================
## 함수기능 : 5개의 정수를 전달받고 덧셈 후 결과 반환
## 함수이름 : addFive
## 매개변수 : num1, num2, num3, num4, num5
## 함수결과 : total
## =================================================
def addFive(num1, num2, num3, num4, num5):
    total = num1 + num2 + num3 + num4 + num5
    return total

## =================================================
## 함수기능 : 3개의 정수를 전달받고 덧셈 후 결과 반환
## 함수이름 : addThree
## 매개변수 : num1, num2, num3
## 함수결과 : total
## =================================================
def addThree(num1, num2, num3):
    total = num1 + num2 + num3
    return total


## =================================================
## 함수기능 : 4개의 정수를 전달받고 덧셈 후 결과 반환
## 함수이름 : addFour
## 매개변수 : num1, num2, num3, num4
## 함수결과 : total
## =================================================
def addFour(num1, num2, num3, num4):
    total = num1 + num2 + num3 + num4 
    return total


## =================================================
## 함수기능 : n개의 정수를 전달받고 덧셈 후 결과 반환
## 함수이름 : addInt
## 매개변수 : 고정 X,  0개, 1개, .... n개
## 함수결과 : total
## =================================================
