## =================================================
##          키워드 파라미터 가변인자 매개변수 함수
## ------------------------------------------------
## -> 데이터 정보와 데이터가 가변인 경우 대비
##    예: 회원가입 시 옵션 선택 
## -> 매개변수 이름 : **변수명
## -> 매개변수 개수 : 0개 ~ N개
## -> 매개변수 형식 : 키1=값,  키2=값 .....
## =================================================
## 함수기능 : 학생의 학점을 출력해주는 기능
##           학생마다 과목 개수와 과목이 다름!! 
## 함수이름 : getGarde
## 매개변수 : **jumsu
## 함수결과 : grade
## =================================================
def getGarde(**jumsu):
    #print("키워드파라미터 : " , type(jumsu))
    grade = 0
    for jum in jumsu.values():
        grade = grade + jum 

    # 과목수로 나누기
    avg = grade/len(jumsu) if len(jumsu) else 0 

    return avg

## ---------------------------------------------------
## 함수 사용 즉, 호출
## ---------------------------------------------------
print(f" getGarde()                                  : {getGarde() }")
print(f" getGarde(kor=90, dance=100)                 : {getGarde(kor=90, dance=100) }")
print(f" getGarde(sci=100, art=99, com=89, life=100) : {getGarde(sci=100, art=99, com=89, life=100) }")
