## =============================================================
## Iterable 타입 : 반복이 가능한 데이터 타입
##                => for ~ in 반복문으로 요소 추출 가능한 타입들
##                => 확인 : 메서드에 _ _iter_ _( ) 존재
## =============================================================
## -------------------------------------------------------------
## Iterable 타입 확인 
## -------------------------------------------------------------
## for ~ in 반복문에서 _ _iter_ _(), _ _next_ _() 사용됨!
iterator = (1,10, 2).__iter__()
iterator = range(1,10, 2).__iter__()
iterator = "Good".__iter__()
print( iterator.__next__() )
print( iterator.__next__() )
print( iterator.__next__() )
print( iterator.__next__() )
#print( iterator.__next__() )  ## StopIteration Error

## -------------------------------------------------------------
## 내장함수 : 반복자를 생성 또는 가져오는 함수 : iter(반복가능한타입) 
##           다음 요소/원소 가져오는 내장함수 : next( 반복자 )
## -------------------------------------------------------------
nums = [4, 7, -1, 3, 5] 
niterator = iter(nums)
print(next(niterator))
print(next(niterator))

## -------------------------------------------------------------
## 내장함수 : 특정값이 나올때까지만 반복해주는 함수 : iter(함수이름, 특정값) 
##           => 사용자 정의 함수때 실습
## -------------------------------------------------------------